; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)
  (:functions 	(time-to-walk ?l1 ?l2 - location)
		(time-to-drive ?l1 ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-4-5-4-244)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	p6-0 - location
	p6-5 - location
	p2-0 - location
	p2-5 - location
	p2-6 - location
	p4-1 - location
	p4-2 - location
	p4-3 - location
	p0-1 - location
	p3-0 - location
	p3-6 - location
	)
	(:init
	(at driver1 s0)
	(at driver2 s6)
	(at driver3 s6)
	(at driver4 s6)
	(at truck1 s1)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s4)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s5)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s1)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at truck5 s3)
	(empty truck5)
	(= (load truck5) 0)
	(= (fuel-per-minute truck5) 10)
	(at package1 s3)
	(at package2 s4)
	(at package3 s6)
	(at package4 s5)
	(path s6 p6-0)
	(path p6-0 s6)
	(path s0 p6-0)
	(path p6-0 s0)
	(= (time-to-walk s6 p6-0) 11)
	(= (time-to-walk p6-0 s6) 11)
	(= (time-to-walk s0 p6-0) 42)
	(= (time-to-walk p6-0 s0) 42)
	(path s6 p6-5)
	(path p6-5 s6)
	(path s5 p6-5)
	(path p6-5 s5)
	(= (time-to-walk s6 p6-5) 47)
	(= (time-to-walk p6-5 s6) 47)
	(= (time-to-walk s5 p6-5) 44)
	(= (time-to-walk p6-5 s5) 44)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(= (time-to-walk s2 p2-0) 34)
	(= (time-to-walk p2-0 s2) 34)
	(= (time-to-walk s0 p2-0) 23)
	(= (time-to-walk p2-0 s0) 23)
	(path s2 p2-5)
	(path p2-5 s2)
	(path s5 p2-5)
	(path p2-5 s5)
	(= (time-to-walk s2 p2-5) 46)
	(= (time-to-walk p2-5 s2) 46)
	(= (time-to-walk s5 p2-5) 31)
	(= (time-to-walk p2-5 s5) 31)
	(path s2 p2-6)
	(path p2-6 s2)
	(path s6 p2-6)
	(path p2-6 s6)
	(= (time-to-walk s2 p2-6) 36)
	(= (time-to-walk p2-6 s2) 36)
	(= (time-to-walk s6 p2-6) 44)
	(= (time-to-walk p2-6 s6) 44)
	(path s4 p4-1)
	(path p4-1 s4)
	(path s1 p4-1)
	(path p4-1 s1)
	(= (time-to-walk s4 p4-1) 11)
	(= (time-to-walk p4-1 s4) 11)
	(= (time-to-walk s1 p4-1) 15)
	(= (time-to-walk p4-1 s1) 15)
	(path s4 p4-2)
	(path p4-2 s4)
	(path s2 p4-2)
	(path p4-2 s2)
	(= (time-to-walk s4 p4-2) 55)
	(= (time-to-walk p4-2 s4) 55)
	(= (time-to-walk s2 p4-2) 45)
	(= (time-to-walk p4-2 s2) 45)
	(path s4 p4-3)
	(path p4-3 s4)
	(path s3 p4-3)
	(path p4-3 s3)
	(= (time-to-walk s4 p4-3) 26)
	(= (time-to-walk p4-3 s4) 26)
	(= (time-to-walk s3 p4-3) 43)
	(= (time-to-walk p4-3 s3) 43)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(= (time-to-walk s0 p0-1) 23)
	(= (time-to-walk p0-1 s0) 23)
	(= (time-to-walk s1 p0-1) 30)
	(= (time-to-walk p0-1 s1) 30)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(= (time-to-walk s3 p3-0) 34)
	(= (time-to-walk p3-0 s3) 34)
	(= (time-to-walk s0 p3-0) 31)
	(= (time-to-walk p3-0 s0) 31)
	(path s3 p3-6)
	(path p3-6 s3)
	(path s6 p3-6)
	(path p3-6 s6)
	(= (time-to-walk s3 p3-6) 16)
	(= (time-to-walk p3-6 s3) 16)
	(= (time-to-walk s6 p3-6) 30)
	(= (time-to-walk p3-6 s6) 30)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 7)
	(= (time-to-drive s2 s0) 7)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 8)
	(= (time-to-drive s3 s0) 8)
	(link s0 s5)
	(link s5 s0)
	(= (time-to-drive s0 s5) 31)
	(= (time-to-drive s5 s0) 31)
	(link s0 s6)
	(link s6 s0)
	(= (time-to-drive s0 s6) 25)
	(= (time-to-drive s6 s0) 25)
	(link s4 s0)
	(link s0 s4)
	(= (time-to-drive s4 s0) 11)
	(= (time-to-drive s0 s4) 11)
	(link s5 s1)
	(link s1 s5)
	(= (time-to-drive s5 s1) 44)
	(= (time-to-drive s1 s5) 44)
	(link s5 s4)
	(link s4 s5)
	(= (time-to-drive s5 s4) 28)
	(= (time-to-drive s4 s5) 28)
	(link s1 s0)
	(link s0 s1)
	(= (time-to-drive s1 s0) 17)
	(= (time-to-drive s0 s1) 17)
	(link s1 s4)
	(link s4 s1)
	(= (time-to-drive s1 s4) 8)
	(= (time-to-drive s4 s1) 8)
	(link s2 s6)
	(link s6 s2)
	(= (time-to-drive s2 s6) 16)
	(= (time-to-drive s6 s2) 16)
	(link s6 s1)
	(link s1 s6)
	(= (time-to-drive s6 s1) 28)
	(= (time-to-drive s1 s6) 28)
	(link s3 s4)
	(link s4 s3)
	(= (time-to-drive s3 s4) 46)
	(= (time-to-drive s4 s3) 46)
	(link s3 s5)
	(link s5 s3)
	(= (time-to-drive s3 s5) 57)
	(= (time-to-drive s5 s3) 57)
	(link s3 s6)
	(link s6 s3)
	(= (time-to-drive s3 s6) 47)
	(= (time-to-drive s6 s3) 47)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver2 s6)
	(at driver3 s3)
	(at driver4 s6)
	(at truck1 s0)
	(at truck2 s2)
	(at truck4 s1)
	(at package1 s2)
	(at package2 s0)
	(at package3 s0)
	(at package4 s1)
	))

(:metric minimize (+ (* 1 (total-time)) (* 3 (fuel-used))))

)

; plan
1. (walk driver1 s0 p0-1)
   deleted: (at driver1 s0)
   added: (at driver1 p0-1)
   goals met: 3 of 10
2. (walk driver1 p0-1 s1)
   deleted: (at driver1 p0-1)
   added: (at driver1 s1)
   goals met: 3 of 10
3. (walk driver1 s1 p4-1)
   deleted: (at driver1 s1)
   added: (at driver1 p4-1)
   goals met: 3 of 10
4. (walk driver1 p4-1 s4)
   deleted: (at driver1 p4-1)
   added: (at driver1 s4)
   goals met: 3 of 10
5. (board-truck driver1 truck2 s4)
   deleted: (at driver1 s4) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 3 of 10
6. (walk driver3 s6 p3-6)
   deleted: (at driver3 s6)
   added: (at driver3 p3-6)
   goals met: 3 of 10
7. (load-truck package2 truck2 s4)
   deleted: (at package2 s4)
   added: (in package2 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 3 of 10
8. (drive-truck truck2 s4 s0 driver1)
   deleted: (at truck2 s4)
   added: (at truck2 s0)
   changed: (fuel-used) from 0 to 121
   goals met: 3 of 10
9. (walk driver3 p3-6 s3)
   deleted: (at driver3 p3-6)
   added: (at driver3 s3)
   goals met: 4 of 10
10. (unload-truck package2 truck2 s0)
   deleted: (in package2 truck2)
   added: (at package2 s0)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 5 of 10
11. (drive-truck truck2 s0 s6 driver1)
   deleted: (at truck2 s0)
   added: (at truck2 s6)
   changed: (fuel-used) from 121 to 371
   goals met: 5 of 10
12. (load-truck package3 truck2 s6)
   deleted: (at package3 s6)
   added: (in package3 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 5 of 10
13. (drive-truck truck2 s6 s0 driver1)
   deleted: (at truck2 s6)
   added: (at truck2 s0)
   changed: (fuel-used) from 371 to 646
   goals met: 5 of 10
14. (unload-truck package3 truck2 s0)
   deleted: (in package3 truck2)
   added: (at package3 s0)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 6 of 10
15. (drive-truck truck2 s0 s5 driver1)
   deleted: (at truck2 s0)
   added: (at truck2 s5)
   changed: (fuel-used) from 646 to 956
   goals met: 6 of 10
16. (load-truck package4 truck2 s5)
   deleted: (at package4 s5)
   added: (in package4 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 6 of 10
17. (drive-truck truck2 s5 s1 driver1)
   deleted: (at truck2 s5)
   added: (at truck2 s1)
   changed: (fuel-used) from 956 to 1440
   goals met: 6 of 10
18. (unload-truck package4 truck2 s1)
   deleted: (in package4 truck2)
   added: (at package4 s1)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 7 of 10
19. (disembark-truck driver1 truck2 s1)
   deleted: (driving driver1 truck2)
   added: (at driver1 s1) (empty truck2)
   goals met: 7 of 10
20. (load-truck package1 truck5 s3)
   deleted: (at package1 s3)
   added: (in package1 truck5)
   changed: (load truck5) from 0 to 1, (fuel-per-minute truck5) from 10 to 11
   goals met: 7 of 10
21. (board-truck driver3 truck5 s3)
   deleted: (at driver3 s3) (empty truck5)
   added: (driving driver3 truck5)
   goals met: 6 of 10
22. (board-truck driver1 truck2 s1)
   deleted: (at driver1 s1) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 6 of 10
23. (drive-truck truck5 s3 s6 driver3)
   deleted: (at truck5 s3)
   added: (at truck5 s6)
   changed: (fuel-used) from 1440 to 1957
   goals met: 6 of 10
24. (drive-truck truck5 s6 s2 driver3)
   deleted: (at truck5 s6)
   added: (at truck5 s2)
   changed: (fuel-used) from 1957 to 2133
   goals met: 6 of 10
25. (unload-truck package1 truck5 s2)
   deleted: (in package1 truck5)
   added: (at package1 s2)
   changed: (load truck5) from 1 to 0, (fuel-per-minute truck5) from 11 to 10
   goals met: 7 of 10
26. (drive-truck truck2 s1 s6 driver1)
   deleted: (at truck2 s1)
   added: (at truck2 s6)
   changed: (fuel-used) from 2133 to 2413
   goals met: 7 of 10
27. (disembark-truck driver3 truck5 s2)
   deleted: (driving driver3 truck5)
   added: (at driver3 s2) (empty truck5)
   goals met: 7 of 10
28. (drive-truck truck2 s6 s1 driver1)
   deleted: (at truck2 s6)
   added: (at truck2 s1)
   changed: (fuel-used) from 2413 to 2693
   goals met: 7 of 10
29. (disembark-truck driver1 truck2 s1)
   deleted: (driving driver1 truck2)
   added: (at driver1 s1) (empty truck2)
   goals met: 7 of 10
30. (board-truck driver1 truck1 s1)
   deleted: (at driver1 s1) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 7 of 10
31. (walk driver3 s2 p4-2)
   deleted: (at driver3 s2)
   added: (at driver3 p4-2)
   goals met: 7 of 10
32. (disembark-truck driver1 truck1 s1)
   deleted: (driving driver1 truck1)
   added: (at driver1 s1) (empty truck1)
   goals met: 7 of 10
33. (walk driver3 p4-2 s4)
   deleted: (at driver3 p4-2)
   added: (at driver3 s4)
   goals met: 7 of 10
34. (board-truck driver1 truck2 s1)
   deleted: (at driver1 s1) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 7 of 10
35. (drive-truck truck2 s1 s6 driver1)
   deleted: (at truck2 s1)
   added: (at truck2 s6)
   changed: (fuel-used) from 2693 to 2973
   goals met: 7 of 10
36. (walk driver3 s4 p4-1)
   deleted: (at driver3 s4)
   added: (at driver3 p4-1)
   goals met: 7 of 10
37. (walk driver3 p4-1 s1)
   deleted: (at driver3 p4-1)
   added: (at driver3 s1)
   goals met: 7 of 10
38. (drive-truck truck2 s6 s1 driver1)
   deleted: (at truck2 s6)
   added: (at truck2 s1)
   changed: (fuel-used) from 2973 to 3253
   goals met: 7 of 10
39. (disembark-truck driver1 truck2 s1)
   deleted: (driving driver1 truck2)
   added: (at driver1 s1) (empty truck2)
   goals met: 7 of 10
40. (board-truck driver3 truck2 s1)
   deleted: (at driver3 s1) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 7 of 10
41. (board-truck driver1 truck1 s1)
   deleted: (at driver1 s1) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 7 of 10
42. (drive-truck truck2 s1 s6 driver3)
   deleted: (at truck2 s1)
   added: (at truck2 s6)
   changed: (fuel-used) from 3253 to 3533
   goals met: 7 of 10
43. (drive-truck truck1 s1 s0 driver1)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   changed: (fuel-used) from 3533 to 3703
   goals met: 8 of 10
44. (drive-truck truck2 s6 s2 driver3)
   deleted: (at truck2 s6)
   added: (at truck2 s2)
   changed: (fuel-used) from 3703 to 3863
   goals met: 9 of 10
45. (disembark-truck driver3 truck2 s2)
   deleted: (driving driver3 truck2)
   added: (at driver3 s2) (empty truck2)
   goals met: 9 of 10
46. (disembark-truck driver1 truck1 s0)
   deleted: (driving driver1 truck1)
   added: (at driver1 s0) (empty truck1)
   goals met: 9 of 10
47. (board-truck driver3 truck5 s2)
   deleted: (at driver3 s2) (empty truck5)
   added: (driving driver3 truck5)
   goals met: 9 of 10
48. (drive-truck truck5 s2 s6 driver3)
   deleted: (at truck5 s2)
   added: (at truck5 s6)
   changed: (fuel-used) from 3863 to 4023
   goals met: 9 of 10
49. (drive-truck truck5 s6 s3 driver3)
   deleted: (at truck5 s6)
   added: (at truck5 s3)
   changed: (fuel-used) from 4023 to 4493
   goals met: 9 of 10
50. (disembark-truck driver3 truck5 s3)
   deleted: (driving driver3 truck5)
   added: (at driver3 s3) (empty truck5)
   goals met: 10 of 10
